Функция ЕстьОтрицательныеОстатки(Ссылка, ДатаОтбора) Экспорт

	 Граница = Новый Граница(ДатаОтбора, ВидГраницы.Включая);
	 
	 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиНоменклатурыОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиНоменклатурыОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(
		|			&Дата,
		|			Номенклатура В
		|				(ВЫБРАТЬ
		|					РасходнаяНакладнаяТовары.Товар КАК Товар
		|				ИЗ
		|					Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
		|				ГДЕ
		|					РасходнаяНакладнаяТовары.Ссылка = &СсылкаРН
		|			
		|				ОБЪЕДИНИТЬ ВСЕ
		|			
		|				ВЫБРАТЬ
		|					ПроизводствоПродукцииМатериалы.Материал КАК Материал
		|				ИЗ
		|					Документ.ПроизводствоПродукции.Материалы КАК ПроизводствоПродукцииМатериалы
		|				ГДЕ
		|					ПроизводствоПродукцииМатериалы.Ссылка = &СсылкаПП)) КАК ОстаткиНоменклатурыОстатки
		|ГДЕ
		|	ОстаткиНоменклатурыОстатки.КоличествоОстаток < 0";
	
	Запрос.УстановитьПараметр("Дата", Граница);
	Запрос.УстановитьПараметр("СсылкаРН", Ссылка);
	Запрос.УстановитьПараметр("СсылкаПП", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
	
		Возврат Ложь;
	
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекСтрока = СтрШаблон("Не хватает ""%1"" в количестве %2", ВыборкаДетальныеЗаписи.Номенклатура, ВыборкаДетальныеЗаписи.КоличествоОстаток);
		Сообщить(ТекСтрока);
	КонецЦикла;
	
	Возврат Истина;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА


КонецФункции // ()
