
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		// Заполнение шапки
		Договор = ДанныеЗаполнения.Договор;
		Поставщик = ДанныеЗаполнения.Поставщик;
		Для Каждого ТекСтрокаМатериалы Из ДанныеЗаполнения.Материалы Цикл
			НоваяСтрока = Материалы.Добавить();
			НоваяСтрока.Количество = ТекСтрокаМатериалы.Количество;
			НоваяСтрока.Материал = ТекСтрокаМатериалы.Материал;
			НоваяСтрока.Сумма = ТекСтрокаМатериалы.Сумма;
			НоваяСтрока.Цена = ТекСтрокаМатериалы.Цена;
		КонецЦикла;
		Для Каждого ТекСтрокаРасходники Из ДанныеЗаполнения.Расходники Цикл
			НоваяСтрока = Расходники.Добавить();
			НоваяСтрока.Количество = ТекСтрокаРасходники.Количество;
			НоваяСтрока.Расходник = ТекСтрокаРасходники.Расходник;
			НоваяСтрока.Сумма = ТекСтрокаРасходники.Сумма;
			НоваяСтрока.Цена = ТекСтрокаРасходники.Цена;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
