
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОберткаСписковМатериалов = Новый Массив;
	
	СписокМатериалов = Новый Массив;
	СписокМатериалов.Добавить(Перечисления.СписокВидовНоменклатуры.Материал);
	СписокМатериалов.Добавить(Перечисления.СписокВидовНоменклатуры.РасходныйМатериал);
	
	ОберткаСписковМатериалов.Добавить(
		Новый ПараметрВыбора("Отбор.ВидНоменклатуры", Новый ФиксированныйМассив(СписокМатериалов))
	);
	
	Элементы.МатериалыМатериал.ПараметрыВыбора = Новый ФиксированныйМассив(ОберткаСписковМатериалов);
	
КонецПроцедуры


