Процедура СформироватьТаблицуЗначений() Экспорт

	СписокТоваров = Новый ТаблицаЗначений;
	СписокТоваров.Колонки.Добавить("Товар");
	СписокТоваров.Колонки.Добавить("Остаток");
	
	СтрокаТаблицы = СписокТоваров.Добавить();
	СтрокаТаблицы.Товар = "Яблоки";
	СтрокаТаблицы.Остаток = 10;
	
	СтрокаТаблицы = СписокТоваров.Добавить();
	СтрокаТаблицы.Товар = "Яблоки";
	СтрокаТаблицы.Остаток = 20;
	
	СтрокаТаблицы = СписокТоваров.Добавить();
	СтрокаТаблицы.Товар = "Груши";
	СтрокаТаблицы.Остаток = 5; 
	
	СписокТоваров.Свернуть("Товар", "Остаток");
	
	Для каждого Строка Из СписокТоваров Цикл
	
		Сообщить(СтрШаблон("%1 - %2", Строка.Товар, Строка. Остаток));
	
	КонецЦикла;

КонецПроцедуры
