Процедура СформироватьМассив() Экспорт

	Коллеги = Новый Массив;
	Коллеги.Добавить("Иванов");
	Коллеги.Добавить("Арбузаов");
	Коллеги.Добавить("Платформов");
	Коллеги.Добавить("Физиков");
	Коллеги.Добавить("Юриков");
	Коллеги.Добавить("Бобров");
	Коллеги.Добавить("Федотов");
	
	Индекс = 0;
	СписокИмен = Новый СписокЗначений;
	
	Для каждого ИмяКоллеги Из Коллеги Цикл 
		
		СписокИмен.Добавить(ИмяКоллеги);
			
	КонецЦикла;
	
	СписокИмен.СортироватьПоЗначению(НаправлениеСортировки.Возр);
	
	Для каждого Строка Из СписокИмен Цикл
	
		СтрокаИмя = СтрШаблон("Ячейка массива с индексом [%1] имеет значение ""%2""", Индекс, Строка);
		Сообщить(СтрокаИмя);
		
		Индекс = Индекс + 1;
	
	КонецЦикла;

КонецПроцедуры

Процедура СформироватьСтруктуру() Экспорт

	ФИО = Новый Структура("Имя, Фамилия, Отчество, Лет", "Владимир", "Иванов", "Михайлович", "33 лет");
	Имя = Лев(ФИО.Имя, 1);
	Отчество = Лев(ФИО.Отчество, 1);
	Сообщить(СтрШаблон("%1 %2.%3. - %4", ФИО.Фамилия, Имя, Отчество, ФИО.Лет));

КонецПроцедуры

