
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СчетаНаОплату") Тогда
		// Заполнение шапки
		ИтоговаяСумма = ДанныеЗаполнения.ИтоговаяСумма;
		Клиент = ДанныеЗаполнения.Клиент;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр РасчетБухгалтерии 
	Движения.РасчетБухгалтерии.Записывать = Истина;
	Движение = Движения.РасчетБухгалтерии.Добавить();
	Движение.СчетДт = ПланыСчетов.ПланыСчетовБухгалтерии.Касса;
	Движение.СчетКт = ПланыСчетов.ПланыСчетовБухгалтерии.Покупатель;
	Движение.Период = Дата;
	Движение.Сумма = ИтоговаяСумма;
	Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Покупатель] = Клиент;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
