Процедура ПодсчитатьСуммуОклада() Экспорт

	Для каждого ЗаписьСотрудника Из ЭтотОбъект Цикл
	
		НормаЧасов = ЗаписьСотрудника.ПолучитьДанныеГрафика(ВидПериодаРегистраРасчета.ПериодДействия).Итог("Часы"); 
		ФактическиеЧасы = ЗаписьСотрудника.ПолучитьДанныеГрафика(ВидПериодаРегистраРасчета.ФактическийПериодДействия).Итог("Часы");
		
		Если НормаЧасов = 0 Тогда
		
			СтрокаВывода = "У вас не заполнен календарь!";
			ВызватьИсключение СтрокаВывода;
		
		КонецЕсли;
		
		ЗаписьСотрудника.СуммаРасчета = ЗаписьСотрудника.Ставка * ФактическиеЧасы;
	
	КонецЦикла;

КонецПроцедуры
