
&НаКлиенте
АСИНХ Процедура ОбработкаКоманды(МассивСсылок, ПараметрыВыполненияКоманды)
	СписокВидовНоменклатуры = ПолучитьВидыНоменклатуры();
	
	ВыбранныйВид = ЖДАТЬ СписокВидовНоменклатуры.ВыбратьЭлементАсинх("Выберите вид номенклатуры:");
	
	Если ВыбранныйВид <> Неопределено Тогда
		 ЗагрузитьВидыНоменклатуры(МассивСсылок, ВыбранныйВид.Значение);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьВидыНоменклатуры()

	Список = Новый СписокЗначений;
	Список.Добавить(Перечисления.СписокВидовНоменклатуры.Материал);
	Список.Добавить(Перечисления.СписокВидовНоменклатуры.РасходныйМатериал);
	Список.Добавить(Перечисления.СписокВидовНоменклатуры.Товар);
	Список.Добавить(Перечисления.СписокВидовНоменклатуры.Услуга);
	
	Возврат Список;

КонецФункции

Процедура ЗагрузитьВидыНоменклатуры(МассивСсылок, ВыбранныйВид)
	Для каждого ОднаСсылка Из МассивСсылок Цикл
		Если НЕ ОднаСсылка.ЭтоГруппа Тогда
			ВыбранныеОбъекты = ОднаСсылка.ПолучитьОбъект();
			ВыбранныеОбъекты.ВидНоменклатуры = ВыбранныйВид;
		    ВыбранныеОбъекты.Записать();  
		Иначе
		    Сообщить("Выберите только записи внутри папки, папку не выбирать!");
			Возврат;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


