#Область ОбработчикиСобытийНаформе 
	&НаКлиенте
	Процедура МатериалыЦенаПриИзменении(Элемент)
		ТекЭлемент = Элементы.Материалы.ТекущиеДанные;
		ФормулаПодсчетаСуммы(ТекЭлемент);
	КонецПроцедуры

	&НаКлиенте
	Процедура МатериалыКоличествоПриИзменении(Элемент)
		ТекЭлемент = Элементы.Материалы.ТекущиеДанные;
		ФормулаПодсчетаСуммы(ТекЭлемент);
	КонецПроцедуры

	&НаКлиенте
	Процедура РасходникиЦенаПриИзменении(Элемент)
		ТекЭлемент = Элементы.Расходники.ТекущиеДанные;
		ФормулаПодсчетаСуммы(ТекЭлемент);
	КонецПроцедуры

	&НаКлиенте
	Процедура РасходникиКоличествоПриИзменении(Элемент)
		ТекЭлемент = Элементы.Расходники.ТекущиеДанные;
		ФормулаПодсчетаСуммы(ТекЭлемент);	
	КонецПроцедуры	
#КонецОбласти

#Область СамостоятельныеПроцедуры
&НаКлиенте
	Процедура ФормулаПодсчетаСуммы(ТекЭлемент)
		ТекЭлемент.Сумма = ТекЭлемент.Цена * ТекЭлемент.Количество;
	КонецПроцедуры	
#КонецОбласти


