#Область ОбработкаСобытий

	&НаКлиенте
	Процедура ТоварыЦенаПриИзменении(Элемент)
		ТекЭлемент = Элементы.Товары.ТекущиеДанные;
		ФормулаПодсчетаСуммы(ТекЭлемент);
	КонецПроцедуры

	&НаКлиенте
	Процедура ТоварыКоличествоПриИзменении(Элемент)
		ТекЭлемент = Элементы.Товары.ТекущиеДанные;
		ФормулаПодсчетаСуммы(ТекЭлемент);
	КонецПроцедуры

	&НаКлиенте
	Процедура ТоварыПроцентСкидкиПриИзменении(Элемент)
		ТекЭлемент = Элементы.Товары.ТекущиеДанные;
		ФормулаПодсчетаСуммы(ТекЭлемент);
	КонецПроцедуры
	
	&НаКлиенте
	Процедура ТоварыТоварПриИзменении(Элемент)
		ТекСтрока = Элементы.Товары.ТекущиеДанные;
		ТекСтрока.Цена = ПолучитьЦенуССервера(ТекСтрока.Товар, Объект.Дата);
	КонецПроцедуры
#КонецОбласти

#Область СамостоятельныеПроцедуры
&НаКлиенте
	Процедура ФормулаПодсчетаСуммы(ТекЭлемент)
		ТекЭлемент.Сумма = ((ТекЭлемент.Цена * ТекЭлемент.Количество) * (1 - ТекЭлемент.ПроцентСкидки / 100));
	КонецПроцедуры	
	
&НаСервереБезКонтекста
	Функция ПолучитьЦенуССервера(Номенклатура, ДатаОтбора)
	
		Возврат РегистрыСведений.ЦеныНоменклатуры.ВыборЦены(Номенклатура, ДатаОтбора);
	
	КонецФункции
	
#КонецОбласти
