
&НаКлиенте
Процедура ЗаполнитьСписокДней(Команда)
	Если Объект.ДатаНачало = '00010101' ИЛИ Объект.ДатаОкончание = '00010101' Тогда
		Сообщить("Интервал загрузки не указан!");
		Возврат;	
	КонецЕсли;
	
	Если Объект.ДатаНачало > Объект.ДатаОкончание Тогда
		Сообщить("Интервал загрузки указан не верно!");
		Возврат;	
	КонецЕсли;
	
	Если Объект.НормаЧасов = 0 Тогда
		Сообщить("Пустая норма часов!");
		Возврат;	
	КонецЕсли;
	
	Объект.Таблица.Очистить();
	
	НачалоДата = Объект.ДатаНачало;
	КонецДата = Объект.ДатаОкончание;
	
	Пока НачалоДата <= КонецДата Цикл
		
		НоваяСтрока = Объект.Таблица.Добавить();
		НоваяСтрока.Дата = НачалоДата;
		НоваяСтрока.Часы = Объект.НормаЧасов;
		НоваяСтрока.Рабочий = (ДеньНедели(НачалоДата) < 6);
		
		НачалоДата = НачалоДата + 86400;
		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеКалендаряНаСервере()
	Отбор = Новый Структура("Рабочий", Истина);
	ВсеСтроки = Объект.Таблица.НайтиСтроки(Отбор);
	
	Для каждого Строка Из ВсеСтроки Цикл
	
		ЗаписьДня = РегистрыСведений.ПроизводственныйКалендарь.СоздатьМенеджерЗаписи();
		ЗаписьДня.Дата = Строка.Дата;
		ЗаписьДня.Часы = Строка.Часы;
		ЗаписьДня.Записать(Истина);
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеКалендаря(Команда)
	Если Объект.Таблица.Количество() = 0 Тогда
	
		Сообщить("Нет данных для импорта!");
		Возврат;
	
	КонецЕсли;
	ЗагрузитьДанныеКалендаряНаСервере();
КонецПроцедуры
