
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Зарплата
	Движения.Зарплата.Записывать = Истина;
	Движение = Движения.Зарплата.Добавить();
	Движение.Сторно = Ложь;
	Движение.ВидРасчета = ПланыВидовРасчета.ВидыРасчета.Прогул;
	Движение.ПериодДействияНачало = НачалоДня(Дата);
	Движение.ПериодДействияКонец = КонецДня(Дата);
	Движение.ПериодРегистрации = КонецМесяца(Дата) + 1;
	Движение.Сотрудник = Сотрудник;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
