
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	// Поля это массив - Ложь, мы его обнуляем
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Наименование");
	Поля.Добавить("Родитель");
	Поля.Добавить("ЭтоГруппа"); 
	//  Стандартный реквизит справочника типа Булево: Истина — группа, Ложь — элемент
	// нужен для Чтобы по-разному формировать представление: для группы — просто наименование, для элемента — наименование + родитель
	// откуда берется Автоматически появляется у справочника, если включена иерархия
КонецПроцедуры 

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; 
	Если Данные.ЭтоГруппа Тогда
		
		Представление = Данные.Наименование;
		
	Иначе
	
		Представление = СтрШаблон("%1 (%2)", Данные.Наименование, Данные.Родитель);	
	
	КонецЕсли;
КонецПроцедуры


