Функция ПолучитьЧасовуюСтавку(СотрудникОтбора, ПериодОтбора) Экспорт	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтавкиСотрудниковСрезПоследних.Ставка КАК Ставка
		|ИЗ
		|	РегистрСведений.СтавкиСотрудников.СрезПоследних(&Дата, Сотрудник = &Сотрудник) КАК СтавкиСотрудниковСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", ПериодОтбора);
	Запрос.УстановитьПараметр("Сотрудник", СотрудникОтбора);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Ставка = 0;
		Возврат Ставка;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Ставка = ВыборкаДетальныеЗаписи.Ставка;
	Возврат Ставка;
КонецФункции
